app/controllers/service_providers_controller.rb

SELECT * FROM "service_providers"
---
  def index
    @service_providers = ServiceProvider.all